eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_24xrgb.c
#ifdef GX_PING_PONG_FRAME_BUFFERS
        /* Toggle frame buffer. */
        temp = canvas->gx_canvas_memory;
        canvas->gx_canvas_memory = visible_frame_buffer;
        visible_frame_buffer = temp;
#endif
    }
    TIMING_CPU_WORK_END
}

/*****************************************************************************/
/* Functions for configuring and using Graphics Layer 2                      */
/*****************************************************************************/
static LTDC_HandleTypeDef  hltdc_anim;
static GX_LAYER_PARAMS layer2_params;

/**************************************************************************/
/*  GraphicsLayerInitialize                                               */ 
/*    Configure graphics layer2, the overlay layer                        */
/**************************************************************************/
static UINT GraphicsLayerInitialize(INT layer, GX_CANVAS *canvas)
{
    int loop;
    GX_COLOR *color;
    ULONG regval;

    if (layer != 2)
    {
        // graphics layer 1 is configured during initial setup, nothing
        // to do here.
        return GX_FAILURE;
    }

    hltdc_anim.Instance = LTDC;
    LCD_LayerCfgTypeDef  Layercfg;

    Layercfg.WindowX0 = 0;
    Layercfg.WindowX1 = canvas->gx_canvas_x_resolution;
    Layercfg.WindowY0 = 0;
    Layercfg.WindowY1 = canvas->gx_canvas_y_resolution;

    Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
    Layercfg.FBStartAdress = (uint32_t) canvas -> gx_canvas_memory;
    Layercfg.Alpha = 255;
    Layercfg.Alpha0 = 0;
    Layercfg.Backcolor.Blue = 0;
    Layercfg.Backcolor.Green = 0;
    Layercfg.Backcolor.Red = 0;
    Layercfg.BlendingFactor1 = LTDC_BLENDING_FACTOR2_PAxCA;
    Layercfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
    Layercfg.ImageWidth = canvas->gx_canvas_x_resolution;
    Layercfg.ImageHeight = canvas->gx_canvas_y_resolution;
    HAL_LTDC_ConfigLayer(&hltdc_anim, &Layercfg, layer - 1); 

    // set the initial alpha to 0 and disable graphics layer2
    LTDC_Layer2->CACR = 0;
    LTDC_Layer2->CR = 0x00;
    LTDC->SRCR = LTDC_SRCR_IMR;

    color = canvas->gx_canvas_memory;

    for (loop = 0; loop < (canvas->gx_canvas_x_resolution * canvas->gx_canvas_y_resolution); loop++)
    {
        *color++ = 0x00;
    }

    layer2_params.canvas_width = canvas->gx_canvas_x_resolution;
    layer2_params.canvas_height = canvas->gx_canvas_y_resolution;

    // save off the vertical and horizontal timing params, so that
    // we can offset from here if the app request a canvas shift

    layer2_params.canvas_memory = (USHORT *) canvas -> gx_canvas_memory;

    regval = LTDC_Layer2->WHPCR;
    layer2_params.horizontal_start = regval & 0xffff;
    regval = LTDC_Layer2->WVPCR;
    layer2_params.vertical_start = regval & 0xffff;
    
    return GX_SUCCESS;
}

/**************************************************************************/
/*  GraphicsLayerShow                                                     */ 
/*    Show the specified graphics layer                                   */
/**************************************************************************/
static VOID GraphicsLayerShow(INT Layer)
{
    LTDC_Layer_TypeDef *layer_regs;

    if (Layer == 1)
    {
        layer_regs = LTDC_Layer1;
    }
    else
    {
        layer_regs = LTDC_Layer2;
    }
    layer_regs -> CR = 0x01;
    LTDC->SRCR = LTDC_SRCR_VBR;
}

/**************************************************************************/
/*  GraphicsLayerHide                                                     */ 
/*    HIde the specified graphics layer                                   */
/**************************************************************************/
static void GraphicsLayerHide(INT Layer)
{
    LTDC_Layer_TypeDef *layer_regs;

    if (Layer == 1)
    {
        layer_regs = LTDC_Layer1;
    }
    else
    {
        layer_regs = LTDC_Layer2;
    }

    layer_regs->CR = 0x00;
    layer_regs->CACR = 0;
    LTDC->SRCR = LTDC_SRCR_VBR;
}

/**************************************************************************/
/*  GraphicsLayerAlphaSet                                                 */ 
/*    Assign graphics layer alpha value                                   */
/**************************************************************************/
static void GraphicsLayerAlphaSet(INT Layer, UCHAR alpha)
{
    LTDC_Layer_TypeDef *layer_regs;

    if (Layer == 1)
    {
        layer_regs = LTDC_Layer1;
    }
    else
    {
        layer_regs = LTDC_Layer2;
    }

    layer_regs->CACR = alpha;
    LTDC->SRCR = LTDC_SRCR_VBR;
}

/**************************************************************************/
/*  GraphicsLayerPosSet                                                   */ 
/*    Assign graphics layer offset within display                         */
/**************************************************************************/
static void GraphicsLayerPosSet(INT layer, GX_VALUE xpos, GX_VALUE ypos)
{
    uint32_t regval;
    uint32_t frame_address;
    INT offset;
    INT width;
    int height;

    if (layer != 2)
    {
        return;
    }

    if (xpos >= 0)
    {
        width = layer2_params.canvas_width;
        
        if ((width + xpos) >= STM32F429_DISCO_SCREEN_WIDTH)
        {
            width = STM32F429_DISCO_SCREEN_WIDTH - xpos;
        }
        frame_address = (uint32_t) layer2_params.canvas_memory;
        LTDC_Layer2->CFBAR = frame_address;

        offset = xpos + layer2_params.horizontal_start;
        regval = ((offset + width - 1) << 16) | offset;
        LTDC_Layer2->WHPCR = regval;
        regval = (layer2_params.canvas_width * 4) << 16;    // horizontal pitch
        regval |= (width * 4) + 3;                          // horizontal line length
        LTDC_Layer2->CFBLR = regval;
    }
    else
    {
        offset = -xpos;
        frame_address = (uint32_t) layer2_params.canvas_memory;
        frame_address += offset * 4;
        LTDC_Layer2->CFBAR = frame_address;

        width = layer2_params.canvas_width - offset;
        regval = ((layer2_params.horizontal_start + width - 1) << 16) | (layer2_params.horizontal_start);
        LTDC_Layer2->WHPCR = regval;
        regval = (layer2_params.canvas_width * 4) << 16;    // horizontal pitch
        regval |= (width * 4) + 3;                          // horizontal line length
        LTDC_Layer2->CFBLR = regval;
    }

    // here for shift in Y direction
    if (ypos >= 0)
    {
        height = layer2_params.canvas_height;
        if ((ypos + height) > STM32F429_DISCO_SCREEN_HEIGHT)
        {
            height = STM32F429_DISCO_SCREEN_HEIGHT - ypos;
        }
        
        LTDC_Layer2->CFBLNR = height;
        
        offset = layer2_params.vertical_start + ypos;
        regval = ((offset + height - 1) << 16) | offset;
        LTDC_Layer2->WVPCR = regval;
    }
    else
    {
        regval = frame_address;
        offset = -ypos;
        regval += offset * layer2_params.canvas_width * 4;
        LTDC_Layer2->CFBAR = regval;

        height = layer2_params.canvas_height - offset;
        regval = ((layer2_params.vertical_start + height - 1) << 16) | (layer2_params.vertical_start);
        LTDC_Layer2->WVPCR = regval;
        LTDC_Layer2->CFBLNR = height;
    }
    LTDC->SRCR = LTDC_SRCR_VBR;
}


/**************************************************************************/
/* define layer services supporting graphics overlay layer                */
/**************************************************************************/
static GX_DISPLAY_LAYER_SERVICES stm32_graphics_layer_services = {
    GraphicsLayerInitialize,
    GraphicsLayerShow,
    GraphicsLayerHide,
    GraphicsLayerAlphaSet,
    GraphicsLayerPosSet
};

/**************************************************************************/
/*  LTDC_IRQHandler                                                       */ 
/*    Handle line interrupt and register reload interrupt                 */
/**************************************************************************/
#if defined(GX_DISABLE_THREADX_TIMER_SOURCE) || defined(GX_PING_PONG_FRAME_BUFFERS)
void LTDC_IRQHandler()
{
#ifdef GX_DISABLE_THREADX_TIMER_SOURCE
    if(LTDC->ISR & LTDC_ISR_LIF)
    {
        /* Clear the line interrupt flag. */
        LTDC->ICR |= LTDC_ICR_CLIF;

