eclipse-threadx/guix/src/display_driver/stm324x9i_eval/gx_display_driver_stm324x9i_24xrgb.c
        /* If there are no active timers just stop the timer from running. */
        if (_gx_system_active_timer_list == GX_NULL &&
            _gx_system_animation_list == GX_NULL)
        {
            return;
        }
         
        GX_EVENT timer_event;
        
        timer_event.gx_event_type = GX_EVENT_TIMER;
        timer_event.gx_event_sender = 0;
        timer_event.gx_event_target = GX_NULL;
        timer_event.gx_event_payload.gx_event_ulongdata = 1;
        _gx_system_event_fold(&timer_event);
    }
#endif
    
#ifdef GX_PING_PONG_FRAME_BUFFERS
    if(LTDC->ISR & LTDC_ISR_RRIF)
    {
        /* Clear register reload interrupt. */
        LTDC->ICR |= LTDC_ICR_CRRIF;
        
        if(frame_buffer_toggle_start)
        {
            frame_buffer_toggle_start = GX_FALSE;
            tx_semaphore_put(&register_reload_semaphore);
        }
    }
#endif
}
#endif

/**************************************************************************/
/* stm32f429_graphics_driver_setup_24xrgb                                 */
/*   Configure hardware layer 1 and initialize GX_DISPLAY drawing         */
/*   services.                                                            */
/**************************************************************************/
UINT stm32f429_graphics_driver_setup_24xrgb(GX_DISPLAY *display)
{
    /* initialize the low-level drawing function pointers

       for windows, these are always just the generic funcions,
       but for some hardware, these will be customized,
       optimized functions specific to that hardware
    */
    _gx_display_driver_24xrgb_setup(display, (VOID*)STM32F429_DISCO_SCREEN_HANDLE, stm32f429_24xrgb_buffer_toggle);

    #if defined(GX_TIMING_ENABLE)
    display->gx_display_driver_drawing_initiate     = gx_chromeart_drawing_initiate;
    display->gx_display_driver_drawing_complete     = gx_chromeart_drawing_complete;
    #endif

    // setup support for second graphics layer:
    display->gx_display_layer_services = &stm32_graphics_layer_services;

    #if defined(GX_CHROMEART_ENABLE)
    /* override those functions that can be accelerated with DMA2D */
    display->gx_display_driver_horizontal_line_draw = gx_chromeart_horizontal_line_draw;
    display -> gx_display_driver_vertical_line_draw = gx_chromeart_vertical_line_draw;
    display -> gx_display_driver_canvas_copy        = gx_chromeart_canvas_copy;
    display -> gx_display_driver_pixelmap_draw      = gx_chromeart_pixelmap_draw;
    display -> gx_display_driver_alphamap_draw      = gx_chromeart_alphamap_draw;
    display -> gx_display_driver_pixelmap_blend     = gx_chromeart_pixelmap_blend;
    display -> gx_display_driver_8bit_glyph_draw    = gx_chromeart_glyph_8bit_draw;
    display -> gx_display_driver_callback_assign    = gx_display_wait_function_set_24xrgb;
    #endif

    /* Hardware Initialization */
    BSP_LCD_Init();

    BSP_LCD_LayerDefaultInit(0, (uint32_t)&frame_buffer);
    BSP_LCD_SelectLayer(0);

#if defined(GX_DISABLE_THREADX_TIMER_SOURCE) || defined(GX_PING_PONG_FRAME_BUFFERS)
#ifdef GX_DISABLE_THREADX_TIMER_SOURCE
    /* Define the position of the line interrupt. */
    LTDC->LIPCR = 0;
    
    /* Enable line interrupt. */
    LTDC->IER |= LTDC_IER_LIE;
#endif
    
#ifdef GX_PING_PONG_FRAME_BUFFERS
    /* Enable reload interrupt. */
    LTDC->IER |= LTDC_IER_RRIE;
    
    tx_semaphore_create(&register_reload_semaphore, "register reload semaphore", 0);
#endif
        
    /* Set USBHS Interrupt priority */
    HAL_NVIC_SetPriority(LTDC_IRQn, 4, 0);
    
    /* Enable USBHS Interrupt */
    HAL_NVIC_EnableIRQ(LTDC_IRQn);
#endif
    
#ifdef GX_FRAME_RATE_TEST_ENABLE
    tx_thread_create(&test_thread, "test thread", test_thread_entry, 0,
                     test_thread_stack, sizeof(test_thread_stack),
                     GX_SYSTEM_THREAD_PRIORITY,
                     GX_SYSTEM_THREAD_PRIORITY, TX_NO_TIME_SLICE, TX_AUTO_START);
#endif
    
    // clear the frame buffer
    memset(frame_buffer, 0, STM32F429_DISCO_SCREEN_WIDTH * STM32F429_DISCO_SCREEN_HEIGHT * 4);

    // configure default DMA params
    DefaultDmaInitStruct();

    BSP_LCD_DisplayOn();
    
    // drive the timing pins high
    TIMING_FRAME_CALC_END
    TIMING_CPU_WORK_END

    /* Return successful status.  */
    return(GX_SUCCESS);
}

